posts/reading/play-for-scala.org
#+BEGIN_COMMENT
.. title: Play for Scala
.. slug: play-for-scala
.. date: 2017-07-15
.. tags: play, scala
.. category: Books
.. link:
.. description:
.. type: text
#+END_COMMENT


* Play for Scala

- Defining Route that takes a HTTP request parameter:
  - To take a request like ~http://localhost:9000/hellp?n=World~
  - In the route:
    #+BEGIN_VERSE
    GET  /hello   controllers.Application.hello(n: String)
    #+END_VERSE
  - In the controller
    #+BEGIN_SRC scala
    def hello(name: String) = Action {
      Ok("hello " + name)
    }
    #+END_SRC
  - Not that the query string parameter n patches the parameter name
    declared in the routes file, not in the hello action method
    parameters.
- A template is a Scala function definition that Play will convert to
  a normal Scala code and compile.
- To render a view, with the view file name as ~hello.scala.html~ in
  the views directory:
  #+BEGIN_SRC scala
  def hello(name: String) = Action {
    Ok(views.html.hello(name)
  }
  #+END_SRC
- To redirect:
  #+BEGIN_SRC scala
  def index = Action {
    Redirect(routes.Products.list())
  }
  #+END_SRC
- To insert content from another template:
  #+BEGIN_SRC html
  <div class="container">
   @content
   @debug()
  </div>
  #+END_SRC
  Notice the differene between ~@content~ and ~@debug()~, while
  ~content~ is a variable, and ~debug~ is the template name to be
  included.
- The flash scope:
  - Most modern frameworks have a flash scope.
  - Like the session scope, it is meant to keep data, related to the
    client, outside of the context of a single request.
  - The difference is that the flash scope is kept for the next
    request only, after which it is removed.
  - Play implements this in the form of a cookie that is cleared on
    every response, except for the response that sets it.
  - It is useful to use flash scope to show one-time messages to the
    user.

* Protecting against Cross Site Request Forgery
- Cross Site Request Forgery (CSRF) is a security exploit where an
  attacker tricks a victims browser into making a request using the
  victims *session*.
- Since the session token is send with every request, if an attacker
  can coerce the victims browser to make a request on their behalf,
  the attacker can make request on the user's behalf.
- By default, Play will require a CSRF check when all of the following
  are true:
  - The request method is not GET, HEAD, or OPTIONS.
  - The request has one or more Cookie, or Authorization headers.
  - The CORS filter is not configured to trust the request's origin.
- Play's primary mechanism for CSRF protection is ~CSRF~ token.
  - The token gets placed either in the query string, or body of every
    form submitted, and also gets placed in the users session.
  - Play then verifies that both tokens are presents and match.

* Proxy settings with a front end HTTP server
- Using a front end HTTP server will rarely give you better
  performance than using Play server directly.
- However HTTP servers are very good at handling *HTTPs*, *conditional
  GET requests* and *static assets*
- Many services assume a front end HTTP server is part of you
  architecture.
- When using an HTTP frontal server, request addresses are seen as
  coming from *the HTTP server*.
- Proxy servers can add a specific header to the request to tell the
  proxied application where the request came from. Most web servers
  will add an *X-Forwarded-For* header with the remote client IP Address
  as first argument.

