posts/reading/play-for-scala/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " vocab="http://ogp.me/ns" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>Play for Scala | Warren Liu</title>
<link href="../../../assets/css/rst.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/poole.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/lanyon.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../../../assets/css/custom.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://wudong.graceliu.uk/posts/reading/play-for-scala/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../programming-in-scala/" title="Programming in scala" type="text/html">
<link rel="next" href="../patterns-enterprise-application-architecture/" title="Patterns of Enterprise Application Architecture" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Play for Scala">
<meta property="og:url" content="https://wudong.graceliu.uk/posts/reading/play-for-scala/">
<meta property="og:description" content="Table of Contents


Play for Scala
Protecting against Cross Site Request Forgery
Proxy settings with a front end HTTP server
Application configuration.
Using Slick for database access
Binding HTTP dat">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="play">
<meta property="article:tag" content="scala">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Play for Scala</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Play for Scala</a></li>
<li><a href="#sec-2">Protecting against Cross Site Request Forgery</a></li>
<li><a href="#sec-3">Proxy settings with a front end HTTP server</a></li>
<li><a href="#sec-4">Application configuration.</a></li>
<li><a href="#sec-5">Using Slick for database access</a></li>
<li><a href="#sec-6">Binding HTTP data to Scala objects</a></li>
<li><a href="#sec-7">Static and compiled assets</a></li>
<li><a href="#sec-8">Action composition</a></li>
<li><a href="#sec-9">Routes</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Play for Scala</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Defining Route that takes a HTTP request parameter:
<ul class="org-ul">
<li>To take a request like <code>http://localhost:9000/hellp?n=World</code>
</li>
<li>In the route:
<p class="verse">
GET  /hello   controllers.Application.hello(n: String)<br></p>
</li>
<li>In the controller
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">hello</span><span class="o">(</span><span class="n">name</span><span class="k">:</span> <span class="kt">String</span><span class="o">)</span> <span class="k">=</span> <span class="nc">Action</span> <span class="o">{</span>
  <span class="nc">Ok</span><span class="o">(</span><span class="s">"hello "</span> <span class="o">+</span> <span class="n">name</span><span class="o">)</span>
<span class="o">}</span>
</pre></div>
</li>
<li>Not that the query string parameter n patches the parameter name
declared in the routes file, not in the hello action method
parameters.
</li>
</ul>
</li>
<li>A template is a Scala function definition that Play will convert to
a normal Scala code and compile.
</li>
<li>To render a view, with the view file name as <code>hello.scala.html</code> in
the views directory:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">hello</span><span class="o">(</span><span class="n">name</span><span class="k">:</span> <span class="kt">String</span><span class="o">)</span> <span class="k">=</span> <span class="nc">Action</span> <span class="o">{</span>
  <span class="nc">Ok</span><span class="o">(</span><span class="n">views</span><span class="o">.</span><span class="n">html</span><span class="o">.</span><span class="n">hello</span><span class="o">(</span><span class="n">name</span><span class="o">)</span>
<span class="o">}</span>
</pre></div>
</li>
<li>To redirect:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">index</span> <span class="k">=</span> <span class="nc">Action</span> <span class="o">{</span>
  <span class="nc">Redirect</span><span class="o">(</span><span class="n">routes</span><span class="o">.</span><span class="nc">Products</span><span class="o">.</span><span class="n">list</span><span class="o">())</span>
<span class="o">}</span>
</pre></div>
</li>
<li>To insert content from another template:
<div class="highlight"><pre><span></span>&lt;div class="container"&gt;
 @content
 @debug()
&lt;/div&gt;
</pre></div>
<p>
Notice the differene between <code>@content</code> and <code>@debug()</code>, while
<code>content</code> is a variable, and <code>debug</code> is the template name to be
included.
</p>
</li>
<li>The flash scope:
<ul class="org-ul">
<li>Most modern frameworks have a flash scope.
</li>
<li>Like the session scope, it is meant to keep data, related to the
client, outside of the context of a single request.
</li>
<li>The difference is that the flash scope is kept for the next
request only, after which it is removed.
</li>
<li>Play implements this in the form of a cookie that is cleared on
every response, except for the response that sets it.
</li>
<li>It is useful to use flash scope to show one-time messages to the
user.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Protecting against Cross Site Request Forgery</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Cross Site Request Forgery (CSRF) is a security exploit where an
attacker tricks a victims browser into making a request using the
victims <b>session</b>.
</li>
<li>Since the session token is send with every request, if an attacker
can coerce the victims browser to make a request on their behalf,
the attacker can make request on the user's behalf.
</li>
<li>By default, Play will require a CSRF check when all of the following
are true:
<ul class="org-ul">
<li>The request method is not GET, HEAD, or OPTIONS.
</li>
<li>The request has one or more Cookie, or Authorization headers.
</li>
<li>The CORS filter is not configured to trust the request's origin.
</li>
</ul>
</li>
<li>Play's primary mechanism for CSRF protection is <code>CSRF</code> token.
<ul class="org-ul">
<li>The token gets placed either in the query string, or body of every
form submitted, and also gets placed in the users session.
</li>
<li>Play then verifies that both tokens are presents and match.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Proxy settings with a front end HTTP server</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Using a front end HTTP server will rarely give you better
performance than using Play server directly.
</li>
<li>However HTTP servers are very good at handling <b>HTTPs</b>, <b>conditional
GET requests</b> and <b>static assets</b>
</li>
<li>Many services assume a front end HTTP server is part of you
architecture.
</li>
<li>When using an HTTP frontal server, request addresses are seen as
coming from <b>the HTTP server</b>.
</li>
<li>Proxy servers can add a specific header to the request to tell the
proxied application where the request came from. Most web servers
will add an <b>X-Forwarded-For</b> header with the remote client IP Address
as first argument.
</li>
</ul>
</div>
</div>
