posts/reading/play-for-scala.org
* Application configuration.
- Configuration options are set in ~conf/application.conf~ file.
- Play uses the *Typesafe config library*, which supports a superset
  of JSON, although plain JSON and Java Properties files are also
  supported.
  - Comments.
  - References to other configuration parameters and system
    environment variables.
    - Environment variable: ~db.default.url = ${DATABASE_URL}~
    - Same ~${...}~ syntax to refer to other configuration variables.
      #+BEGIN_VERSE
      log.directory = /var/log
      log.access = ${log.directory}/access.log
      log.errors = ${log.directory}/errors.log
      #+END_VERSE
  - File includes: ~include "db-default.conf"~
    - Single value will *replace* the previous value.
    - Object notation can be used to *merge* multiple values.
  - Merge multiple configuration files.
  - Specifying an alternative configuration file or URL using system
    properties.
    - override a property value: ~$ start -Ddb.default.url=...~
    - override the whole ~application.conf~, using either relative or
      absolute path:
      #+BEGIN_SRC sh
      $ run -Dconfig.file=conf/production.conf
      $ run -Dconfig.file=/etc/products/production.conf
      #+END_SRC
  - Units specifiers for durations, such as ~days~, and sizes in bytes,
    such as ~MB~
  - ~play.api.Configuration~ provides type-safe access to
    configuration parameter values:
    - supports ~String~, ~Int~, ~Boolean~
    - Configurations are structured hierarchically. The API allows you
      to get a subconfiguration of the current configuration.
  - Note that it would be better *not to hardcode the version
    information* in the configuration file. Instead, you might get the
    information from a revision control system by writing the output
    of commands like ~git describe --always~ to a file and reading
    that from your application.

* Using Slick for database access
- Slick is intended as a Scala-based API for relational database access.
- The idea is that you use it instead of using JDBC directly or adding
  a complex object-relational mapping framework.
- Slick uses Scala language features to allow you to map database
  tables to *Scala collections* and to *execute queries*
- With scala, this results in less code and cleaner code compared to
  directly using JDBC.
- An example, to map a database table to a ~Product~ data access
  object using Scala code:
  #+BEGIN_SRC scala
    object Product extends Table[(Long, String, String)] ("Products"){
      def ean = column[Long]("ean", O.PrimaryKey)
      def name = column[String]("name")
      def description = column[String]("description")
      def * = ena ~ name ~ description
    }

    val products = for {
      product <- Product.sortBy(Product => product.name.asc)
    } yeild (product)

    val url = "jdbc:postgresql:/localhost/slick?user=slick&password=slick"
    Database.forURL(url, driver="org.postgresql.Driver") withSession {
      val productList = products.list
    }
  #+END_SRC

* Binding HTTP data to Scala objects
- Action methods often have parameters, it is need to be able to map
  HTTP request data to those parameters.
- The routing and the subsequent parameter binding are both part of
  the *mapping* between HTTP and Scala's interfaces, which is a
  translation between two very different interface style.
- Play has a number of separate build-in binders for different types,
  and you can also implement your own binders.

* Static and compiled assets
- Architects and web frameworks often take the view that static files
  should be handled differently than generated content in a web
  application's architecture
- In Play, this probably a *premature optimization*. If you have high
  performance requirements for serving static content, the best
  approach is probably to use a *cache*, or *load balancer* in front
  of Play, instead of avoiding serving the files using Play in the
  first place.
- Play provides an *assets controller* to serve static files.

* Action composition
- Action are functions, which means you can compose them to apply
  common functionality to multiple actions.
- For example, you can defined actions for caching and authentication
  and use them like this:
  #+BEGIN_SRC scala
  def list = Authenticated {
       Cached {
            Action {
              //process request.
            }
       }
  }
  #+END_SRC
  - This example uses ~Action~ to create an action function that is
    passed as a parameter to ~Cached~, which returns a new action function.
  - This, in turn, is passed as parameter to ~Authenticated~, which
    decorate the action function again.

