posts/reading/play-for-scala/index.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Application configuration.</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Configuration options are set in <code>conf/application.conf</code> file.
</li>
<li>Play uses the <b>Typesafe config library</b>, which supports a superset
of JSON, although plain JSON and Java Properties files are also
supported.
<ul class="org-ul">
<li>Comments.
</li>
<li>References to other configuration parameters and system
environment variables.
<ul class="org-ul">
<li>Environment variable: <code>db.default.url = ${DATABASE_URL}</code>
</li>
<li>Same <code>${...}</code> syntax to refer to other configuration variables.
<p class="verse">
log.directory = /var/log<br>
log.access = ${log.directory}/access.log<br>
log.errors = ${log.directory}/errors.log<br></p>
</li>
</ul>
</li>
<li>File includes: ~include "db-default.conf"~
<ul class="org-ul">
<li>Single value will <b>replace</b> the previous value.
</li>
<li>Object notation can be used to <b>merge</b> multiple values.
</li>
</ul>
</li>
<li>Merge multiple configuration files.
</li>
<li>Specifying an alternative configuration file or URL using system
properties.
<ul class="org-ul">
<li>override a property value: <code>$ start -Ddb.default.url=...</code>
</li>
<li>override the whole <code>application.conf</code>, using either relative or
absolute path:
<div class="highlight"><pre><span></span>$ run -Dconfig.file<span class="o">=</span>conf/production.conf
$ run -Dconfig.file<span class="o">=</span>/etc/products/production.conf
</pre></div>
</li>
</ul>
</li>
<li>Units specifiers for durations, such as <code>days</code>, and sizes in bytes,
such as <code>MB</code>
</li>
<li>
<code>play.api.Configuration</code> provides type-safe access to
configuration parameter values:
<ul class="org-ul">
<li>supports <code>String</code>, <code>Int</code>, <code>Boolean</code>
</li>
<li>Configurations are structured hierarchically. The API allows you
to get a subconfiguration of the current configuration.
</li>
</ul>
</li>
<li>Note that it would be better <b>not to hardcode the version
information</b> in the configuration file. Instead, you might get the
information from a revision control system by writing the output
of commands like <code>git describe --always</code> to a file and reading
that from your application.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Using Slick for database access</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Slick is intended as a Scala-based API for relational database access.
</li>
<li>The idea is that you use it instead of using JDBC directly or adding
a complex object-relational mapping framework.
</li>
<li>Slick uses Scala language features to allow you to map database
tables to <b>Scala collections</b> and to <b>execute queries</b>
</li>
<li>With scala, this results in less code and cleaner code compared to
directly using JDBC.
</li>
<li>An example, to map a database table to a <code>Product</code> data access
object using Scala code:
<div class="highlight"><pre><span></span><span class="k">object</span> <span class="nc">Product</span> <span class="k">extends</span> <span class="nc">Table</span><span class="o">[(</span><span class="kt">Long</span>, <span class="kt">String</span>, <span class="kt">String</span><span class="o">)]</span> <span class="o">(</span><span class="s">"Products"</span><span class="o">){</span>
  <span class="k">def</span> <span class="n">ean</span> <span class="k">=</span> <span class="n">column</span><span class="o">[</span><span class="kt">Long</span><span class="o">](</span><span class="s">"ean"</span><span class="o">,</span> <span class="n">O</span><span class="o">.</span><span class="nc">PrimaryKey</span><span class="o">)</span>
  <span class="k">def</span> <span class="n">name</span> <span class="k">=</span> <span class="n">column</span><span class="o">[</span><span class="kt">String</span><span class="o">](</span><span class="s">"name"</span><span class="o">)</span>
  <span class="k">def</span> <span class="n">description</span> <span class="k">=</span> <span class="n">column</span><span class="o">[</span><span class="kt">String</span><span class="o">](</span><span class="s">"description"</span><span class="o">)</span>
  <span class="k">def</span> <span class="o">*</span> <span class="k">=</span> <span class="n">ena</span> <span class="o">~</span> <span class="n">name</span> <span class="o">~</span> <span class="n">description</span>
<span class="o">}</span>

<span class="k">val</span> <span class="n">products</span> <span class="k">=</span> <span class="k">for</span> <span class="o">{</span>
  <span class="n">product</span> <span class="k">&lt;-</span> <span class="nc">Product</span><span class="o">.</span><span class="n">sortBy</span><span class="o">(</span><span class="nc">Product</span> <span class="k">=&gt;</span> <span class="n">product</span><span class="o">.</span><span class="n">name</span><span class="o">.</span><span class="n">asc</span><span class="o">)</span>
<span class="o">}</span> <span class="n">yeild</span> <span class="o">(</span><span class="n">product</span><span class="o">)</span>

<span class="k">val</span> <span class="n">url</span> <span class="k">=</span> <span class="s">"jdbc:postgresql:/localhost/slick?user=slick&amp;password=slick"</span>
<span class="nc">Database</span><span class="o">.</span><span class="n">forURL</span><span class="o">(</span><span class="n">url</span><span class="o">,</span> <span class="n">driver</span><span class="o">=</span><span class="s">"org.postgresql.Driver"</span><span class="o">)</span> <span class="n">withSession</span> <span class="o">{</span>
  <span class="k">val</span> <span class="n">productList</span> <span class="k">=</span> <span class="n">products</span><span class="o">.</span><span class="n">list</span>
<span class="o">}</span>
</pre></div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Binding HTTP data to Scala objects</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Action methods often have parameters, it is need to be able to map
HTTP request data to those parameters.
</li>
<li>The routing and the subsequent parameter binding are both part of
the <b>mapping</b> between HTTP and Scala's interfaces, which is a
translation between two very different interface style.
</li>
<li>Play has a number of separate build-in binders for different types,
and you can also implement your own binders.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Static and compiled assets</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Architects and web frameworks often take the view that static files
should be handled differently than generated content in a web
application's architecture
</li>
<li>In Play, this probably a <b>premature optimization</b>. If you have high
performance requirements for serving static content, the best
approach is probably to use a <b>cache</b>, or <b>load balancer</b> in front
of Play, instead of avoiding serving the files using Play in the
first place.
</li>
<li>Play provides an <b>assets controller</b> to serve static files.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Action composition</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Action are functions, which means you can compose them to apply
common functionality to multiple actions.
</li>
<li>For example, you can defined actions for caching and authentication
and use them like this:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">list</span> <span class="k">=</span> <span class="nc">Authenticated</span> <span class="o">{</span>
     <span class="nc">Cached</span> <span class="o">{</span>
	  <span class="nc">Action</span> <span class="o">{</span>
	    <span class="c1">//process request.</span>
	  <span class="o">}</span>
     <span class="o">}</span>
<span class="o">}</span>
</pre></div>
<ul class="org-ul">
<li>This example uses <code>Action</code> to create an action function that is
passed as a parameter to <code>Cached</code>, which returns a new action function.
</li>
<li>This, in turn, is passed as parameter to <code>Authenticated</code>, which
decorate the action function again.
</li>
</ul>
</li>
</ul>
</div>
</div>
