posts/reading/play-for-scala.org
* Routes
- Add an optional page number parameter, with a default value:
  #+BEGIN_VERSE
  GET  /products      controllers.Products.list(page: Int ?=1)
  #+END_VERSE
  - The ~?=~ syntax for an optional parameter isn't normal Scala
    syntax, and it is only used in the ~routes~ file.
  - Can also use ~=~ for fixed parameter values that aren't specified
    in the URL  ~(page: Int =1)~,
  - and ~Option~ for optional parameters that may or may not be
    include din the query string ~(page: Option[Int])~.
- Matching URL path parameters that contain forward slashes:
  #+BEGIN_VERSE
  # This route will not work ~:file~ contains forward slashes.
  GET  /photo/:file    controllers.Media.photo(file: String)
  # This route will work.
  GET  /photo/*file    controllers.Media.photo(file: String)
  #+END_VERSE
- Matching regexp:
  #+BEGIN_VERSE
  # This will only match ean conform to the regexp \d{13}
  GET   /product/$ean<\d{13}>   controllers.Products.details(ean: Long)
  GET   /product/:alias   controllers.Products.details(alias: String)
  #+END_VERSE
- Binding HTTP data
  - Play, along with other modern web frameworks such as Spring MVC,
    improves on treating HTTP request parameters as strings by
    performing type conversion *before* it attempts to call action.
  - Only when type conversion succeeds does Play call the action
    method.
  - Binding applies to two kinds of request data:
    - URL path parameters
    - and query string parameters.
  - Play defines binders for a number of basic types.
  - You can also add binding for custom types, such as your
    application's domain model types, by adding your own ~Formatter~
    implementation.
  - Binding the content of an HTML form to a domain object, using a
    ~form object~
- Generating HTTP calls for actions with reverse routing.
  - map a particular action method invocation to the corresponding
    URL.
  - avoid hard coding path.
    #+BEGIN_SRC scala
      def delete(ean: Long) = Action {
        Product.delete(ean)
        Redirect(routes.Products.list())
      }
    #+END_SRC
  - The reverse route generates a URL in the form of an HTTP call (a
    ~play.pai.mvc.Call~) for certain action method, including the
    parameter values.
