posts/reading/play-for-scala/index.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">Routes</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Add an optional page number parameter, with a default value:
<p class="verse">
GET  /products      controllers.Products.list(page: Int ?=1)<br></p>
<ul class="org-ul">
<li>The <code>?=</code> syntax for an optional parameter isn't normal Scala
syntax, and it is only used in the <code>routes</code> file.
</li>
<li>Can also use <code>=</code> for fixed parameter values that aren't specified
in the URL  <code>(page: Int =1)</code>,
</li>
<li>and <code>Option</code> for optional parameters that may or may not be
include din the query string <code>(page: Option[Int])</code>.
</li>
</ul>
</li>
<li>Matching URL path parameters that contain forward slashes:
<p class="verse">
# This route will not work <code>:file</code> contains forward slashes.<br>
GET  <i>photo</i>:file    controllers.Media.photo(file: String)<br>
# This route will work.<br>
GET  /photo/*file    controllers.Media.photo(file: String)<br></p>
</li>
<li>Matching regexp:
<p class="verse">
# This will only match ean conform to the regexp \d{13}<br>
GET   <i>product/$ean&lt;\d{13}&gt;   controllers.Products.details(ean: Long)<br>
GET   /product</i>:alias   controllers.Products.details(alias: String)<br></p>
</li>
<li>Binding HTTP data
<ul class="org-ul">
<li>Play, along with other modern web frameworks such as Spring MVC,
improves on treating HTTP request parameters as strings by
performing type conversion <b>before</b> it attempts to call action.
</li>
<li>Only when type conversion succeeds does Play call the action
method.
</li>
<li>Binding applies to two kinds of request data:
<ul class="org-ul">
<li>URL path parameters
</li>
<li>and query string parameters.
</li>
</ul>
</li>
<li>Play defines binders for a number of basic types.
</li>
<li>You can also add binding for custom types, such as your
application's domain model types, by adding your own <code>Formatter</code>
implementation.
</li>
<li>Binding the content of an HTML form to a domain object, using a
<code>form object</code>
</li>
</ul>
</li>
<li>Generating HTTP calls for actions with reverse routing.
<ul class="org-ul">
<li>map a particular action method invocation to the corresponding
URL.
</li>
<li>avoid hard coding path.
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">delete</span><span class="o">(</span><span class="n">ean</span><span class="k">:</span> <span class="kt">Long</span><span class="o">)</span> <span class="k">=</span> <span class="nc">Action</span> <span class="o">{</span>
  <span class="nc">Product</span><span class="o">.</span><span class="n">delete</span><span class="o">(</span><span class="n">ean</span><span class="o">)</span>
  <span class="nc">Redirect</span><span class="o">(</span><span class="n">routes</span><span class="o">.</span><span class="nc">Products</span><span class="o">.</span><span class="n">list</span><span class="o">())</span>
<span class="o">}</span>
</pre></div>
</li>
<li>The reverse route generates a URL in the form of an HTTP call (a
<code>play.pai.mvc.Call</code>) for certain action method, including the
parameter values.
</li>
</ul>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/play/" rel="tag">play</a></li>
            <li><a class="tag p-category" href="../../../categories/scala/" rel="tag">scala</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../programming-in-scala/" rel="prev" title="Programming in scala">Previous post</a>
            </li>
            <li class="next">
                <a href="../patterns-enterprise-application-architecture/" rel="next" title="Patterns of Enterprise Application Architecture">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
